Study2/src/Documents/СнятиеСЗаказа/СнятиеСЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СнятиеСЗаказа</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ЗаказанныеТовары</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФилиалПоставки</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтмены</name>
    <type>
      <types>EnumRef.ПричиныОтменыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Study2/src/AccumulationRegisters/ЗаказанныеТовары/ЗаказанныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказанныеТовары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Study2/src/Documents/СнятиеСЗаказа/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Автор = ДанныеЗаполнения.Автор;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ФилиалПоставки = ДанныеЗаполнения.ФилиалПоставки;
		
		ЗапросТовара = Новый Запрос("ВЫБРАТЬ
		|	ЗаказанныеТоварыОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаказанныеТоварыОстаткиИОбороты.КоличествоКонечныйОстаток) КАК Количество,
		|	ЗаказанныеТоварыОстаткиИОбороты.СуммаПриход / ЗаказанныеТоварыОстаткиИОбороты.КоличествоПриход КАК Цена,
		|	СУММА(ЗаказанныеТоварыОстаткиИОбороты.СуммаПриход / ЗаказанныеТоварыОстаткиИОбороты.КоличествоПриход * ЗаказанныеТоварыОстаткиИОбороты.КоличествоКонечныйОстаток) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ЗаказанныеТовары.ОстаткиИОбороты(, , , , Заказ = &Заказ) КАК ЗаказанныеТоварыОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказанныеТоварыОстаткиИОбороты.Номенклатура,
		|	ЗаказанныеТоварыОстаткиИОбороты.СуммаПриход / ЗаказанныеТоварыОстаткиИОбороты.КоличествоПриход");
		
		ЗапросТовара.УстановитьПараметр("Заказ", ДанныеЗаполнения.Ссылка);
		ТаблицаТовара = ЗапросТовара.Выполнить().Выгрузить();
		
		Состав.Загрузить(ТаблицаТовара);
		СуммаДокумента = Состав.Итог("Сумма");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЗаказанныеТовары.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл 
		Если ЗначениеЗаполнено(ТекСтрокаСостав.Номенклатура ) Тогда
			Движение = Движения.ЗаказанныеТовары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Заказ = ДокументОснование;
			Движение.Филиал = ФилиалПоставки;
			Движение.Номенклатура = ТекСтрокаСостав.Номенклатура;
			Движение.Количество = ТекСтрокаСостав.Количество;
			Движение.Сумма = ТекСтрокаСостав.Сумма;
		КонецЕсли;
	КонецЦикла;  
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЗаказанныеТоварыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказанныеТоварыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	РегистрНакопления.ЗаказанныеТовары.Остатки(, Заказ = &Заказ) КАК ЗаказанныеТоварыОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказанныеТоварыОбороты.Номенклатура,
	|	-ЗаказанныеТоварыОбороты.КоличествоОборот
	|ИЗ
	|	РегистрНакопления.ЗаказанныеТовары.Обороты(, , Регистратор) КАК ЗаказанныеТоварыОбороты
	|ГДЕ
	|	ЗаказанныеТоварыОбороты.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Номенклатура КАК Номенклатура,
	|	СУММА(ВременнаяТаблица.КоличествоОстаток) КАК Количество
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблица.Номенклатура");
	
	Запрос.УстановитьПараметр("Заказ", ДокументОснование);
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();	
	
	Для Каждого Строка из Состав Цикл 
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			НайденнаяСтрока = ТаблицаЗапроса.Найти(Строка.Номенклатура,"Номенклатура");
			
			Если НайденнаяСтрока = Неопределено Тогда
				Отказ = Истина;
				Сообщить("Товар " + Строка.Номенклатура + " не был в заказе, либо был принят получателем");
			Иначе
				Если НайденнаяСтрока.Количество < Строка.Количество Тогда
					Отказ = Истина;
					Сообщить(СтрШаблон("Вы не можете снять с заказа товар %1, т.к.  не совпадает с количеством заказаного товара", Строка.Номенклатура));
				КонецЕсли;
				
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - Строка.Количество;	
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
